; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	image1 - mode
	spectrograph0 - mode
	infrared2 - mode
	Star0 - direction
	Star2 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star6 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation9)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation9)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 infrared2)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star6)
	(supports instrument6 infrared2)
	(supports instrument6 image1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation9)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite1 GroundStation4)
	(have_image Star10 image1)
	(have_image Phenomenon11 infrared2)
	(have_image Star12 infrared2)
	(have_image Star13 image1)
	(have_image Planet14 infrared2)
	(have_image Planet15 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 7
2. (turn_to satellite0 groundstation4 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 7
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
4. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 7
5. (turn_to satellite0 planet15 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet15)
   goals met: 1 of 7
6. (take_image satellite0 planet15 instrument0 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 2 of 7
7. (turn_to satellite0 planet14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet14)
   goals met: 2 of 7
8. (take_image satellite0 planet14 instrument0 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 3 of 7
9. (turn_to satellite0 phenomenon11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 7
10. (take_image satellite0 phenomenon11 instrument0 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 4 of 7
11. (turn_to satellite0 star10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star10)
   goals met: 4 of 7
12. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 5 of 7
13. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
14. (take_image satellite0 star12 instrument0 infrared2)
   added: (have_image star12 infrared2)
   goals met: 6 of 7
15. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 6 of 7
16. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 7 of 7
